Revit 2026 API

# SelectionSetElementIds Method

---
**Namespace:** Autodesk.Revit.UI.Selection**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetElementIds(
	ICollection<ElementId> elementIds
)
```
```vb
Public Sub SetElementIds (
	elementIds As ICollection(Of ElementId)
)
```
```cpp
public:
void SetElementIds(
	ICollection<ElementId^>^ elementIds
)
```
```fsharp
member SetElementIds :
        elementIds : ICollection<ElementId> -> unit
```

#### Parameters

elementIds ICollectionElementId

#### Reference

Selection Class

Autodesk.Revit.UI.Selection Namespace